package lesson1;

import lesson2.HomeWork;

public class ClassWork  {
    public static void main(String[] args) {
        //Задача 1.Есть 3 стороны треугольника, напечатать на консоль его периметр
        int a = 5;
        int b = 7;
        int c = 9;

        int perimeter = a + b + c;
        System.out.println("Есть 3 стороны треугольника, напечатать на консоль его периметр");
        System.out.print("Перимерт треугольника равен: " + perimeter);
    }

}



